Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: རིག་བྱེད་གསུམ་དང་སྒྲ་ངེས་པར་སྦྱོར་བ་དང་བཅས་པ་དང་ཤེས་གསལ་དང་བཅས་པ་དང་། ཡི་གེ་རབ་ཏུ་དབྱེ་བ་དང་བཅས་པ་ལྔ་པ་སྟེ། སྔོན་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འཇིག་རྟེན་རྒྱང་འཕེན་པའི་གཞི་ལུང་སྟོན་པ་མཆོད་སྦྱིན་གྱི་རྒྱུད་དང་། སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཉིད་དག་ལ་རྗེས་སུ་ཤེས་ཤིང་
en: He himself practiced recitation and the memorization of scripture and mastered the three types of knowledge, as well as linguistics, Kaiṭabha literature, grammar, the Fifth, the topics of the past, the teachings of the Lokāyata system, the scriptures on sacrifice, and the characteristics of great men.

source: ཡོངས་སུ་ཤེས་པ་རིག་པ་གསུམ་གྱི་ཚིག་ལ་བྲི་བ་མེད་པ། ལས་ཀྱི་རྣམ་པར་སྨིན་པའི་རྫུ་འཕྲུལ་ཐོབ་པ་འཛིན་པ།
en: His understanding of the three types of knowledge was impeccable, and he possessed miraculous powers through karmic ripening.

source: སློངས་མོས་འཚོ་བ། མུ་སྟེགས་གདོལ་བ་ཐམས་ཅད་ལ་ཀུན་ཏུ་སློང་བ།
en: Living from alms, he accepted the donations of any extremist or outcaste.

source: དེ་སློངས་མོའི་འཚོ་བས་འཚོ་བར་བྱའོ་སྙམ་ནསསེམས་ཅན་ཐམས་ཅད་ཀྱི་ལྟོ་འགེངས་པར་བྱེད་དེ། ཉི་མ་སྟོང་དུ་སྟོན་མོ་བྱེད། ཉི་མ་ཉིས་སྟོང་དང་། སུམ་སྟོང་དང་བཞི་སྟོང་དང་ལྔ་སྟོང་དུ་ཡང་སྟོན་མོ་བྱེད་དོ། །
en: While thus committed to a beggar’s livelihood, he decided to feed all beings. He therefore prepared feasts that lasted for a thousand, two thousand, three thousand, and even five thousand days.

source: ཐབས་དེས་ལོ་འབུམ་ཕྲག་བརྒྱད་དུ་ཟླ་བའི་མཆོད་སྦྱིན་རབ་ཏུ་བསྒྲུབས་ཤིང་ལོ་འབུམ་ཕྲག་བརྒྱད་དུ་གང་ལ་སེམས་རབ་ཏུ་ཉམས་པ་ཡོན་གནས་སུ་ལ་ཡང་ཡོངས་སུ་མ་ཞུས་སོ། །
en: In this way he performed the moon sacrifice for eight hundred thousand years, and for the same amount of time he did not serve anyone with a degenerate mind.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་ཞེས་བྱ་བ་ནས།
en: “At that time there appeared in the world a thus-gone one named Free from All Suffering;

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་བྱུང་ངོ་། །
en: he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་དེའི་འདུས་པ་ནི་སྐར་མ་དང་མཉམ་པར་གྱུར། བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་ཡང་སྐར་མ་དང་མཉམ་པར་གྱུར་ཏོ། །
en: The gathering of hearers belonging to the thus-gone Free from All Suffering was equal to the stars, as was his gathering of bodhisattvas.

source: དེ་ནས་བྲམ་ཟེ་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “The brahmin Joyous Moon, who was like a great sal tree, thought to himself,

source: བདག་གི་མཆོད་སྦྱིན་གྱི་བཀད་སར་ཡ་མཚན་ཅན་ཀུན་ཕལ་ཆེར་འཇུག་ན།
en: ‘Almost everyone has visited my wonderful place for the distribution of alms.

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བའི་ཉན་ཐོས་འབའ་ཞིག་མི་འཇུག་ཅིང་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་ཡང་མི་འཇུག་ན།
en: Yet neither the hearers of the thus-gone Free from All Suffering, nor the thus-gone Free from All Suffering himself, have come to my kitchen.

source: གང་གིས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དེ་བདག་གི་མཆོད་སྦྱིན་གྱི་བཀད་སར་འཇུག་པར་འགྱུར་བའི་ཐབས་ཅི་ཡོད།
en: What can I do to make the thus-gone Free from All Suffering and his saṅgha of hearers come here where I distribute alms?

source: དེ་བདག་གི་མཆོད་སྦྱིན་དེ་ལ་རྟོག་སྟེ།
en: Let me think about the offerings that we make.

source: མཆོད་སྦྱིན་གྱི་སྐྱོན་གྱི་ཉེས་པ་གང་ཞིག་གིས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པར་མཆོད་སྦྱིན་གྱི་བཀད་ས་འདིར་མི་འཇུག་སྙམ་མོ། །
en: Is there perhaps anything wrong with our offerings, since the thus-gone Free from All Suffering and his saṅgha of hearers have avoided paying us a visit?

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ནི་དུས་སུ་ཟ་བ་ཡིན་ལ། བདག་གི་སྦྱིན་པ་ཆེན་པོ་འདི་ནི་གྲུབ་པས་འདྲིམ་པ་ཡིན་ཏེ།
en: The thus-gone Free from All Suffering and his saṅgha of hearers only eat at specific times, and my large gifts are distributed only when they have already eaten.

source: སྐྱོན་དེས་དེ་བཞིན་གཤེགས་པ་དེ་བདག་གི་མཆོད་སྦྱིན་གྱི་བཀད་སར་མི་འཇུག་པ་ལྟ་ཞིག་སྙམ་མོ། །
en: It must be due to that mistake that the Thus-Gone One hasn’t been visiting the place where I distribute alms.’

source: དེ་ནས་བྲམ་ཟེ་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ནང་པར་སྔར་ལངས་ནས། བྲམ་ཟེ་དང་བྲམ་ཟེ་མོ་རབ་ཏུ་མང་པོ་དག་གིས་ཡོངས་སུ་བསྐོར། མདུན་དུ་བདར་ནས། དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་ག་ལ་བ་དེར་སོང་སྟེ།
en: “The next morning the brahmin Joyous Moon, who was like a great sal tree, rose early and, accompanied by many male and female brahmins, he set out to meet the thus-gone Free from All Suffering.

source: བྲམ་ཟེའི་ཚོགས་མང་པོས་ཡོངས་སུ་བསྐོར་ནས་ཐམས་ཅད་རྟ་རྒོད་མ་དཀར་མོའི་ཤིང་རྟ་ལ་ཞོན་ཏེ། དེ་བཞོན་པའི་ས་ཇི་ཙམ་པ་དེ་ཙམ་དུ་བཞོན་པས་སོང་བ་ནས་བབས་ཏེ།
en: At first they all traveled in chariots pulled by white mares but when they could no longer travel further in that way,

source: དེ་རྐང་པའི་བར་གྱིས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་ག་ལ་བ་དེར་སོང་བ་དང་།
en: they dismounted and walked to where the thus-gone Free from All Suffering was residing.

source: དེས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་དེ་ཤིང་ལྗོན་པ་གཞན་ཞིག་གི་དྲུང་ན་གནས་ཤིང་བཞུགས་ཏེ་
en: Finally, they beheld the thus-gone Free from All Suffering seated under a tree.

source: བཟང་ཞིང་མཛེས་ལ་དབང་པོ་དུལ་བ་ཐུགས་དུལ་བ།
en: He was fine and handsome, with his senses and mind serene.

source: ཞི་གནས་དུལ་བ་དམ་པ་བརྙེས་པ།
en: He rested peacefully, having attained true gentleness.

source: ཞི་གནས་དུལ་བ་མཆོག་བརྙེས་པ་སྦས་པ་གླང་པོ་དབང་པོ་ཐུལ་བ་མཚོ་ལྟར་དང་ཞིང་རྙོག་པ་མེད་ལ་རབ་ཏུ་གསལ་བ་གསེར་གྱི་མཆོད་སྡོང་ལྟར་འབར་བ་མཐོང་ངོ་། །
en: He rested calmly, having attained genuine gentleness. He was vigilant and disciplined like an elephant, radiant and pristine like a lake, and shining like a golden reliquary.

source: མཐོང་ནས་ཀྱང་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “The brahmin thought,

source: གང་བདག་གིས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་འདི་དགེ་སློང་གི་ཚོགས་སུ་ཤེས་པ་ནི་བདག་གིས་རྙེད་པ་ངན་པ་རྙེད་དེ། བཟང་པོ་མ་རྙེད་དོ། །
en: ‘I used to think of the thus-gone Free from All Suffering as if he were a member of the saṅgha of monks. That was unfortunate, not something fortunate!

source: བཅོམ་ལྡན་འདས་འདི་ནི་ཕུལ་དུ་བྱུང་བ་ཡིན་ཏེ། ཕུལ་དུ་བྱུང་བའི་གནས་སུ་བཞུགས་པར་བྱ་ཞིང་
en: The Blessed One is sublime, and must be treated accordingly.

source: ཕུལ་དུ་བྱུང་བའི་ཞལ་ཟས་དང་གཟིམས་ཆ་དང་། སྙུན་རྐྱེན་གྱི་གསོས་སྨན་གྱི་ཡོ་བྱད་རྣམས་ཀྱིས་བསྟོད་པར་བྱའོ་སྙམ་ནས
en: I must honor him with the most exquisite foods, bedding, and healing treatments.’

source: དེ་བཞིན་གཤེགས་པ་དེའི་དྲུང་དུ་སོང་སྟེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: “Thus the brahmin went before the Thus-Gone One, draped his shawl over one shoulder, and placed his right knee on the ground.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་དེའི་ཕྱག་གཉིས་ལ་བཟུང་ནས། ཁས་ཡོངས་སུ་གཏུགས་ཏེ།
en: Taking hold of the blessed thus-gone Free from All Suffering’s hands, he kissed them.

source: བཅོམ་ལྡན་འདས་བདག་ནི་བྲམ་ཟེ་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ལགས་སོ། །
en: Then he declared his name and family line saying,

source: ཞེས་བདག་གི་མིང་དང་རུས་ལན་གསུམ་གྱི་བར་དུ་གསོལ་ཅིང་།
en: He said this three times and then continued:

source: བཅོམ་ལྡན་འདས་དགེ་སློང་མ་ལགས་ཏེ།
en: ‘Blessed One, you are not a monk.

source: ཕུལ་དུ་བྱུང་བར་གནས་པ་ལགས་ན་གང་བདག་གིས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་ཚོགས་སུ་བགྲངས་པ།
en: You are sublime, and yet I counted you as one among the monks.

source: བཅོམ་ལྡན་འདས་ནོངས་པ་འཆགས་སོ། །
en: I have erred, Blessed One.

source: བདག་ནོངས་པར་གཟུང་དུ་གསོལ།
en: Please know that I have erred.

source: བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པར་ཇི་སྲིད་བཞུགས་ཀྱི་བར་དུ་གཟིམས་ཆ་དང་། སྙུན་རྐྱེན་གསོས་སྨན་གྱི་ཡོ་བྱད་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་བདག་མཆོད་པ་བགྱིད་པར་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་གནང་བར་མཛད་དུ་གསོལ།
en: Please allow me to serve you and your saṅgha for along as you remain, offering you bedding and healing treatments.’

source: དེ་སྐད་ཅེས་གསོལ་བ་དང་། དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བས་བྲམ་ཟེ་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “The thus-gone Free from All Suffering then spoke to the brahmin Joyous Moon, who was like a great sal tree:

source: ཟླ་དགའ་ཤིན་ཏུ་བདེ་བར་གྱུར་ཅིག །
en: ‘Joyous Moon, be at complete ease.

source: ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དང་། ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། གང་གཞན་ཡང་ལུས་ཆེན་པོར་འདུག་པ་དག་བདེ་བ་འདོད་དེ།
en: Gods, humans, demigods, nāgas, yakṣas, gandharvas, and all other large beings all want happiness.

source: ཟླ་དགའ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ནི་གང་ཟག་གཅིག་གི་ཕྱིར་ཇི་སྲིད་འཚོའི་བར་དུ་མི་བཞུགས་སོ། །
en: But, Joyous Moon, as long as he lives, the Blessed Buddha does not act for the sake of just one being.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་འཇིག་རྟེན་ལ་ཕན་པའི་ཕྱིར་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: Because the thus-gone, worthy, perfect buddhas appear in the world to benefit the entire world.

source: སེམས་ཅན་གང་དག་ཟས་དང་མལ་དང་གོས་དང་གནས་རབ་ཏུ་ཉམས་པ་དེ་རྣམས་ལ་དེ་བཞིན་གཤེགས་པ་ཐུགས་བརྩེ་བའི་ཕྱིར་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: The Thus-Gone One has appeared out of love for those who lack food, a resting place, clothing, and a home.’

source: གསོལ་བ་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་དགུང་བདུན་དུ་བདེ་བའི་རིམ་གྲོ་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་བདག་ཡོ་བྱད་ཀུན་གྱིས་མཆོད་པ་བགྱིད་པར་དེ་གནང་བར་མཛད་དུ་གསོལ།
en: “ ‘Blessed One,’ insisted the brahmin, ‘please allow me to serve you and your saṅgha of hearers with pleasing offerings for at least seven days!’

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་དེས་བྲམ་ཟེ་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་ཅང་མི་གསུང་བར་གྱུར་པས་གནང་ངོ་། །
en: “Out of love for the brahmin Joyous Moon, who was like a great sal tree, the thus-gone Free from All Suffering did not reply, and thereby he accepted the invitation.

source: དེ་ནས་བྲམ་ཟེ་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་དེ་ཅང་མི་གསུང་བར་གྱུར་པས་གནང་བར་རིག་ནས།
en: The brahmin Joyous Moon, who was like a great sal tree, understood that the blessed thus-gone Free from All Suffering’s silence was a sign of his acceptance,

source: བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: and so Joyous Moon bowed his head to the Blessed One’s feet.

source: སྟན་ལས་ལངས་ནས་བདག་གི་གནས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་རང་གི་གཉེན་བསྡུས་སོ། །
en: He then stood up and returned to his home.

source: དེ་བསྡུས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Once back home, he gathered his relatives and told them,

source: གང་བདག་གིས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དེ་ཞག་བདུན་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་གདུགས་ཚོད་ལ་སྤྱན་དྲངས་པ་ཁྱེད་ཤེས་པར་གྱིས་ཤིག །
en: ‘Please be aware that I have invited the thus-gone Free from All Suffering and his saṅgha of hearers to receive elaborate midday meals here for a period of seven days.

source: དེ་ལ་ཁྱེད་ནུས་པ་ཅི་ཡོད་པ་དང་། མཐུ་ཅི་ཡོད་པའི་ལུས་ཀྱིས་འབད་པར་གྱིས་ཤིག །
en: Please help me with whatever physical power and might you may have!’

source: དེ་དག་གིས་ལེགས་སོ་ཞེས་སྨྲས་སོ། །
en: “ ‘Very well,’ replied his friends.

source: དེས་ན་བྲན་དང་ལས་བྱེད་པ་དང་ཞོ་ཤས་འཚོ་བ་རྣམས་ལ་སྨྲས་པ།
en: “Next Joyous Moon addressed his servants, workers, and employees, saying,

source: གྲོགས་པོ་དག་གང་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་ཞག་བདུན་དུ་ཡོ་བྱད་ཐམས་ཅད་ལ་སྤྱན་དྲངས་པར་ཤེས་པར་གྱིས་ཤིག །
en: ‘Friends, please be aware that I have invited the thus-gone Free from All Suffering to receive elaborate midday meals for a period of seven days.

source: དེ་ལ་ཁྱེད་ནུས་པ་ཅི་ཡོད་པ་དང་། མཐུ་ཅི་ཡོད་པའི་སྟོབས་ཀྱིས་འབད་པར་གྱིས་ཤིག །
en: Please apply yourselves to this with all your power and might!’

source: དེ་དག་གིས་ཀྱང་ལེགས་སོ་ཞེས་སྨྲས་སོ། །
en: “ ‘Very well,’ they replied.

source: དེ་མཛའ་བཤེས་དང་། བློན་པོ་དང་། གཉེན་དང་། སྣག་གི་གཉེན་མཚམས་དང་། བྲན་དང་ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་ཐམས་ཅད་དང་ལྷན་ཅིག་ཏུ་འཁོར་གྱི་ཁྱམས་བརྩིགས་ཏེ།
en: “Together with his relatives, friends, officials, kinsmen, servants, workers, and employees,

source: གདན་བཤམས་ཤིང་ཡོ་བྱད་དབུལ་བ་ཐམས་ཅད་ཀྱང་བཤམས་སོ། །
en: Joyous Moon then built a courtyard and equipped it with seats and various utensils.

source: དེ་མཚན་མོ་དེ་འདས་ནས་ཕོ་ཉས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་བཅོམ་ལྡན་འདས་བྲམ་ཟེ་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུའི་དུས་ལ་བབ་ལགས་ཏེ།
en: The next morning he dispatched a messenger, who went before the Thus-Gone One and said, ‘Blessed One, the time has come to visit the brahmin Joyous Moon, who is like a great sal tree.

source: གང་གི་དུས་ལ་ད་བབ་པར་མཁྱེན་ན་གདུགས་ཚོད་ལགས་སོ། །
en: Please acknowledge that the time has now come for the midday meals.’

source: ཁྱིམ་བདག་སོང་ལ་སྟན་ཤོམས་ཤིག་བཀའ་བཞིན་འཚལ་ཞེས་མི་དེ་དེ་བཞིན་གཤེགས་པ་དེའི་ལྟར་མཉན་ནས
en: “ ‘Householder,’ replied the Blessed One, ‘you may leave and prepare the seats.’

source: ཟླ་དགའི་དྲུང་དུ་སོང་སྟེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །བྲམ་ཟེ་གསོལ་ལགས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེའི་གདན་ཤོམས་ཤིག །
en: “ ‘Indeed,’ replied the messenger, and so he returned to Joyous Moon saying, ‘Brahmin, you can prepare the Thus-Gone One’s seat.’

source: དེར་འཁོར་གྱི་ཁྱམས་བྱས་ཏེ། ཆུར་དཔག་ཚད་བཅུ་གཉིས་ལ་ཞེང་དུ་ཡང་དཔག་ཚད་བཅུ་གཉིས་པའི་འཁོར་གྱི་ཁྱམས་བྱས་ནས། ཀླུའི་རྒྱལ་པོ་ལ་སྨྲས་པ།
en: “Having prepared a courtyard that was twelve leagues long and twelve leagues wide, Joyous Moon approached the nāga kings, saying,

source: གྲོགས་པོ་དག་གང་བཅོམ་ལྡན་འདས་འཁོར་དང་བཅས་པ་སང་གདུགས་ཚོད་གསོལ་བར་བྱ་བ་ཤེས་པར་མཛོད་ཅིག །
en: ‘Friends, please be informed that the Blessed One and his retinue will arrive for their midday meal tomorrow.’

source: ཁྱིམ་བདག་ལེགས་སོ་ཞེས་སྨྲས་ཏེ་གནང་ངོ་། །
en: “ ‘Very well,’ replied the nāga kings, thus expressing their approval.

source: དེས་གནོད་སྦྱིན་རྣམས་ལ་སྨྲས་པ།
en: “Next, Joyous Moon approached the yakṣas and told them,

source: བཅོམ་ལྡན་འདས་འཁོར་དང་བཅས་པ་དེའི་གདན་ཤོམས་ཤིག །
en: ‘Please prepare the seats for the Blessed One and his retinue.’

source: བཀའ་བཞིན་འཚལ་ལོ་ཞེས་གནོད་སྦྱིན་རྣམས་ཀྱིས་ཟླ་དགའི་ལྟར་མཉན་ནས་ཀུན་ནས་དཔག་ཚད་བཅུ་གཉིས་སུ་གདན་བཤམས་སོ། །
en: “ ‘We shall do that!’ replied the yakṣas, and in accord with Joyous Moon’s wishes the yakṣas then arranged the seats within the twelve-league enclosure.

source: ཀླུའི་རྒྱལ་པོ་དེ་ཡང་སྤོས་ཆུའི་ཆག་ཆག་འདེབས་སོ། །
en: At the same time, the nāga kings sprinkled the compound with scented waters.

source: དེས་དྲི་ཟ་རྣམས་ལ་སྨྲས་པ།
en: “Joyous Moon then spoke to the gandharvas:

source: གྲོགས་པོ་དག་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དེ་གདུགས་ཚོད་གསོལ་བ་ན་ཁྱེད་རྣམས་ཀྱིས་རོལ་མོའི་སྒྲ་ལོང་ཤིག །
en: ‘Friends, the Blessed One will be arriving here for a midday meal, accompanied by his saṅgha of hearers. Please provide a musical accompaniment.’

source: དེས་གྲུལ་བུམ་རྣམས་ལ་སྨྲས་པ།
en: To the kumbhāṇḍas he said,

source: གྲོགས་པོ་དག་ཁྱེད་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་བླ་རེ་བྲེ་བར་གྱིས་ཤིག །
en: ‘Friends, please raise canopies for the Blessed One.’

source: དེས་ཀླུའི་རྒྱལ་པོ་རྣམས་ལ་སྨྲས་པ།
en: And to the nāga kings he requested,

source: གྲོགས་པོ་དག་ཁྱེད་ཀྱིས་རླུང་བསིལ་བ་གཏང་བར་བྱ་སྟེ
en: ‘Friends, please send a cooling wind.

source: དེ་བཞིན་གཤེགས་པ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་གདུགས་ཚོད་གསོལ་བ་ན་ཚ་བར་འགྱུར་བ་མེད་པར་གྱིས་ཤིག།
en: Please ensure that it is not hot while the Thus-Gone One and his saṅgha of hearers are enjoying their meal.’

source: བདག་ཉིད་ཀྱི་འཁོར་གྱི་ཁྱམས་ཀླུའི་དབང་པོ་དེའི་རྒྱན་ཀུན་ཏུ་བྲེ་སྟེ། ཀླུའི་ནོར་བུ་དང་མུ་ཏིག་གི་བླ་རེས་ཀྱང་ཡང་དག་པར་གཡོགས་སོ། །
en: The nāga rulers also adorned Joyous Moon’s courtyard with their ornaments and erected canopies of jewels and pearls.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་ནང་པར་སྔར་ཆོས་གོས་གསོལ། ལྷུང་བཟེད་བསྣམས་ནས་
en: “Early the next morning the thus-gone Free from All Suffering donned his dharma robe and took up his alms bowl.

source: ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་བྲམ་ཟེ་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་གདུགས་ཚོད་སྦྱོར་བ་ག་ལ་བ་དེར་གཤེགས་ནས་གདན་བཤམས་པ་དེ་ལ་བཞུགས་ཏེ། གཡོན་རོལ་དུ་དགེ་སློང་གི་དགེ་འདུན་ནོ། །
en: Accompanied by his saṅgha of hearers, he then proceeded to the site where the brahmin Joyous Moon, who was like a great sal tree, had made the arrangements for the midday meal. There he took his seat and the saṅgha of monks sat down in a row to his left.

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བཞུགས་མ་ཐག་ཏུ་ཀླུ་དང་དྲི་ཟ་རྣམས་འདུས་ནས་རོལ་མོའི་སྒྲ་མངོན་པར་རབ་ཏུ་ལེན་ཏོ། །
en: As soon as the Buddha and the saṅgha of monks had taken their seats, the nāgas and gandharvas gathered to play music, while divine perfumed powders trickled down from the sky.

source: བར་སྣང་ལས་ལྷའི་སྤོས་ཕྱེ་མ་མངོན་པར་རབ་ཏུ་འཐོར་རོ། །
en: “At that time the thus-gone Free from All Suffering performed a magical feat.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་དེ། དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་པས་འཁོར་གྱི་ཁྱམས་དེ་ཀུན་ནས་དཔག་ཚད་བརྒྱ་པར་འདུག་ལ་བཻ་དཱུརྱའི་ར་བས་བསྐོར་ཅིང་ཤེལ་གྱི་ཁ་རན་ཡོངས་སུ་བཏགས་སོ། །
en: Thus, by the Thus-Gone One’s miraculous doing, the courtyard was extended to measure one hundred leagues and the enclosure became surrounded by a beryl fence adorned with crystal pavilions.

source: དེ་ནས་དྲང་སྲོང་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བཞུགས་པར་རིག་ནས།
en: “The brahmin Joyous Moon, who was like a great sal tree, saw that the Buddha and the other members of the saṅgha of monks had taken their places,

source: བཟའ་བ་དང་བཅའ་བ་དང་མྱང་བ་ཞིམ་པོ་རབ་ཏུ་མང་བས་ཡང་དག་པར་བྲིམས། ཡང་དག་པར་ཚིམ་པར་བྱས་ཤིང་།
en: and so he served them delicious and abundant food and drink of various kinds to their satisfaction.

source: ལྷའི་རོལ་མོའི་སྒྲ་དག་ཡང་དག་པར་རབ་ཏུ་བླངས། ལྷའི་བདུག་སྤོས་དག་གིས་བདུགས་ལ། ལྷའི་སྤོས་དག་གིས་གཏོར་ཏོ། །
en: Divine music was played, divine incense burned, and divine perfumes sprinkled.

source: བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་གདུགས་ཚོད་གསོལ་བ་དང་། གདུགས་ཚོད་གསོལ་བར་རིག་ནས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་དཔག་བསམ་གྱི་རས་བཅོས་བུ་ཟུང་གིས་མངོན་པར་གཡོགས་སོ། །
en: Seeing the Blessed One and his saṅgha of monks partaking of their meal, Joyous Moon covered them with two magnificent cotton fabrics.

source: དེའི་ཚེ་ཉི་མ་དང་ཟླ་བ་ནས་དཀྱིལ་འཁོར་གྱི་མཐའི་ལྷའི་བུ་གཟི་བརྗིད་ཆེ་བ་གཟི་བརྗིད་ཆེ་བའི་བར་དག་གིས་ཡོངས་སུ་གང་བར་གྱུར་ཏོ། །
en: At that point the location filled up with gods, from the sun and the moon until the limits of the circle, one more splendid than the other.

source: དེ་ནས་དྲང་སྲོང་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་གདུགས་ཚོད་གསོལ་བར་རིག་ནས། ལྷུང་བཟེད་དང་ཆབ་ཕུལ་ཏེ།
en: Then, as the brahmin Joyous Moon, who was like a great sal tree, saw that the Blessed One and his saṅgha of monks had completed their meal, he offered them alms bowls and water.

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས། བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Placing his right knee on the ground, he then spoke to the Blessed One:

source: བཅོམ་ལྡན་འདས་བདག་གི་སྦྱིན་པ་སེམས་ཅན་ཐམས་ཅད་ལ་སྩལ་བར་བགྱི་སྟེ།
en: ‘Blessed One, may my gifts be for all sentient beings.

source: དགེ་བའི་རྩ་བ་འདིས་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་གྱུར་ཅིག །
en: By these roots of virtue may all beings awaken to unsurpassed and perfect buddhood.’

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེས་འཛུམ་པ་མཛད་དེ།
en: “At this point the Blessed One smiled.

source: ཇི་ལྟ་བུའི་འཛུམ་པ་མཛད་པས་ཟླ་བ་དང་ཉི་མ་ནས་དཀྱིལ་འཁོར་གྱི་མཐའི་ལྷ་དང་མི་རྣམས་ཀྱི་བར་ལ་གསེར་གྱི་འོད་ཀྱི་མདོག་གིས་ཁྱབ་བོ། །
en: As he did so, all the gods, from the sun and the moon until the limits of the circle, as well as all the humans who were present there, became bathed in a golden light .

source: དེ་ནས་དྲང་སྲོང་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The sage Joyous Moon, who was like a great sal tree, said to the Blessed One,

source: གང་བཅོམ་ལྡན་འདས་ཀྱིས་འོད་བཏང་བའི་འོད་འདིས་ཇི་ཙམ་དུ་སེམས་ཅན་རྣམས་ལ་རེག་པ་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ལ་མི་ཕྱེད་པའི་དད་པ་སྐྱེས་ལགས་སོ། །
en: ‘Blessed One, as this light spreads from you, all beings who are touched by it experience undivided faith.

source: བཅོམ་ལྡན་འདས་དགེ་བའི་རྩ་བ་འདིའི་རྣམ་པར་སྨིན་པ་གང་ལགས་པ་དེ་སེམས་ཅན་ཐམས་ཅད་ལ་སྩལ་བར་བགྱིའོ། །
en: May the ripening of these roots of virtue reach all beings.

source: བཅོམ་ལྡན་འདས་གང་འཛུམ་པ་མཛད་པ་དེའི་རྒྱུ་གང་ལགས། རྐྱེན་གང་ལགས།
en: Blessed One, what has caused your smile, and what were its conditions?’

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བ་དེས་བྲམ་ཟེ་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “The blessed thus-gone Free from All Suffering then said to the brahmin Joyous Moon, who was like a great sal tree,

source: བྲམ་ཟེ་ཇི་ཅི་ཙམ་དུ་འོད་འདིས་རེག་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཏེ།
en: ‘Brahmin, all beings who are touched by this light become irreversible from unsurpassed and perfect buddhahood.

source: དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་བྱས་ཏེ།
en: Having awoken to unsurpassed and perfect buddhahood within their completely pure buddha realms, they will benefit all beings

source: ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདའ་བའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ།
en: and then pass beyond suffering within the field of nirvāṇa, free from any remainder of the aggregates.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་ཀྱིས་བོན་དེ་བསྐྱེད་པ་ཡིན་ནོ། །
en: All of them have produced this seed of awakening.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དེ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ནས་གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ། །
en: Having declared to all those beings that future awakening will be unsurpassed and perfect buddhahood, the Thus-Gone One then rose from his seat and departed.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the brahmin Joyous Moon, who was like a great sal tree, was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་ཟླ་དགའ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་ཏོ། །
en: In those days I was the brahmin Joyous Moon, who was like a great sal tree.

source: ངས་སེམས་ཅན་དེ་དག་ལུང་བསྟན་པར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་ལ་སེམས་རབ་ཏུ་དང་བས་ཞག་བདུན་དུ་བཀུར་སྟི་བྱས། བླ་མར་བྱས་ཏེ་རྗེད་ཅིང་མཆོད་དོ། །
en: Thus I venerated, revered, honored, and worshiped the Thus-Gone One with great devotion for one week, so that those beings would receive their prophecy.

source: དེ་བཞིན་གཤེགས་པ་དེས་ང་ལུང་མ་བསྟན་ཀྱང་ངའི་སེམས་ཞུམ་པ་ཡང་མེད་ལ་ང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ་སྙམ་དུ་ཡང་མི་སེམས་སོ། །
en: Although the Thus-Gone One did not grant me a prophecy, I did not feel disheartened, nor did I feel that I could not awaken to unsurpassed and perfect buddhahood.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པ་ལ་རིམ་གྲོ་བྱ་བའི་ཕྱིར་སྙོམ་ལས་མེད་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must serve the thus-gone ones without any laziness.

source: རིམ་གྲོ་བྱ་བ་ལ་སྙོམ་ལས་མེད་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མྱུར་དུ་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ལ་གནས་པར་འགྱུར་རོ། །
en: A bodhisattva who serves without laziness will quickly reach the qualities of the irreversible stage.”

source: མཽད་གལ་གྱི་བུ་ངས་སྐྱེ་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སྐྱེ་བ་ཤེས་པ་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ། སེམས་ཅན་དག་སྐྱེ་བ་ཤེས་པ་ཐོས་ནས་ཆོས་བདག་མེད་པ་ཉིད་བརྗོད་པ་དང་། སྐྱེ་བ་ཡང་ཇི་ལྟར་སྟོན་པར་འགྱུར་སྙམ་ནས། དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand birth. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of birth. I also wondered how, once they had heard about the knowledge of birth, I might best teach about the absence of self in phenomena and about birth.
